# 4.9: Intro to Data Visualization with Python- Part 1

## 03. Import your analysis libraries, as well as your new customer data set as a dataframe

In [2]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
#creating path
path = r'C:\Users\shrav\_Data_Analysis_CF\career_foundry\31-05-2020_InstacartBasketAnalysis'

In [4]:
# Import new customer data set from the 'Original Data' folder as a dataframe
customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [5]:
# Check the dimensions of the dataframe
customers.shape

(206209, 10)

In [6]:
# Preview the newly imported dataframe 
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [7]:
# View descriptive statistics 
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [8]:
# Check data types
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

## 04.Wrangle the data so that it follows consistent logic

In [9]:
# Rename the columns to establish uniformity
customers.rename(columns = {'First Name' : 'First_name'}, inplace = True)

In [10]:
customers.rename(columns = {'Surnam' : 'Last_name'}, inplace = True)

In [11]:
customers.rename(columns = {'STATE' : 'State'}, inplace = True)

In [12]:
customers.rename(columns = {'date_joined' : 'Date_joined'}, inplace = True)

In [13]:
customers.rename(columns = {'n_dependants': 'number_of_dependants'}, inplace = True)

In [14]:
customers.rename(columns = {'fam_status' : 'Marital_status'}, inplace = True)

In [15]:
customers.rename(columns = {'income' : 'Income'}, inplace = True)

In [16]:
# Check columns

customers.columns

Index(['user_id', 'First_name', 'Last_name', 'Gender', 'State', 'Age',
       'Date_joined', 'number_of_dependants', 'Marital_status', 'Income'],
      dtype='object')

#### The columns have been successfully renamed and are now uniform and clear

In [17]:
customers.head()

,user_id,First_name,Last_name,Gender,State,Age,Date_joined,number_of_dependants,Marital_status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## 05. Complete the fundamental data quality and consistency checks

In [18]:
# Address data-types and potential mixed data-types in the dataframe
customers.dtypes

user_id                  int64
First_name              object
Last_name               object
Gender                  object
State                   object
Age                      int64
Date_joined             object
number_of_dependants     int64
Marital_status          object
Income                   int64
dtype: object

In [19]:
# Check for missing data
customers.isnull().sum()

user_id                     0
First_name              11259
Last_name                   0
Gender                      0
State                       0
Age                         0
Date_joined                 0
number_of_dependants        0
Marital_status              0
Income                      0
dtype: int64

#### First_name has 11,259 missing values

In [20]:
# Checking for mixed data-types in each column
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

First_name

In [21]:
# The output revealed that the 'first_name' column has mixed data-types that need to be addressed
customers['First_name'] = customers['First_name'].astype('str')

In [22]:
# The 'user_id' column, while not containing mixed data-types, is still improperly listed as an integer
customers['user_id'] = customers['user_id'].astype('str')

In [23]:
# Re-check the data-types in the data frame and for mixed data-types
customers.dtypes

user_id                 object
First_name              object
Last_name               object
Gender                  object
State                   object
Age                      int64
Date_joined             object
number_of_dependants     int64
Marital_status          object
Income                   int64
dtype: object

#### Now all columns are the appropriate data-types and no mixed data-types are present in any columns

In [24]:
# Re-check for missing data
customers.isnull().sum()

user_id                 0
First_name              0
Last_name               0
Gender                  0
State                   0
Age                     0
Date_joined             0
number_of_dependants    0
Marital_status          0
Income                  0
dtype: int64

In [25]:

# Check for full-duplicates
customers_dups = customers[customers.duplicated()]

In [26]:
customers_dups

Empty DataFrame
Columns: [user_id, First_name, Last_name, Gender, State, Age, Date_joined, number_of_dependants, Marital_status, Income]
Index: []

In [27]:
# Perform a descriptive statistic check to ensure everything looks normal
customers.describe()

                 Age  number_of_dependants         Income
count  206209.000000         206209.000000  206209.000000
mean       49.501646              1.499823   94632.852548
std        18.480962              1.118433   42473.786988
min        18.000000              0.000000   25903.000000
25%        33.000000              0.000000   59874.000000
50%        49.000000              1.000000   93547.000000
75%        66.000000              3.000000  124244.000000
max        81.000000              3.000000  593901.000000

#### There's nothing unusual present in the descriptive statistics

 ## 06. Combine your customer data with the rest of your prepared Instacart data

In [28]:
# Import and define dataframe including newly derived columns from the previous exercise
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_grouped.pkl'))

In [29]:
# Check the shape of the newly imported dataframe
ords_prods_merge.shape

(32404859, 25)

In [30]:
# Check the shape of the customers dataframe
customers.shape

(206209, 10)

In [31]:
# Identify a shared column
ords_prods_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_spend,spender_flag,customer_frequency,frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Mid-range product,Regularly busy,Regularly busy,Most orders,32,Regular customer,6.935811,Low_spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Mid-range product,Regularly busy,Regularly busy,Average orders,32,Regular customer,6.935811,Low_spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Mid-range product,Busiest day,Busiest days,Average orders,5,New customer,7.930208,Low_spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Mid-range product,Regularly busy,Slowest days,Most orders,3,New customer,4.972414,Low_spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Mid-range product,Least busy,Slowest days,Average orders,3,New customer,4.972414,Low_spender,9.0,Frequent customer

In [32]:
customers.head()

,user_id,First_name,Last_name,Gender,State,Age,Date_joined,number_of_dependants,Marital_status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [33]:
# Both dataframes share the 'user_id' column
# Check data-type of shared column
ords_prods_merge.dtypes['user_id']

dtype('int64')

In [34]:
# Make sure both key columns are the same data type
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [35]:
ords_prods_merge.dtypes['user_id']

dtype('O')

In [36]:
customers.dtypes['user_id']

dtype('O')

In [37]:
# The key columns now have matching data-types

In [38]:
# Drop the existing '_merge' column from previous exercises
ords_prods_merge = ords_prods_merge.drop(columns=['_merge'])

In [39]:
# Merge the two dataframes using the column 'user_id' as the shared column with the default join (inner)
custs_ords_prods = ords_prods_merge.merge(customers, on = 'user_id', indicator = True)

In [40]:
# This new dataframe combines both the customers and orders_products dataframes and uses the 'user_id' column as its key 
# Check shape of newly merged dataframe
custs_ords_prods.shape

(32404859, 34)

In [41]:
custs_ords_prods.head(5)

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,First_name,Last_name,Gender,State,Age,Date_joined,number_of_dependants,Marital_status,Income,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302,both
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both

In [42]:
# Check inner join value counts
custs_ords_prods['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [43]:
# Check data-types
custs_ords_prods.dtypes

product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
order_id                     int64
user_id                     object
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
first_order                   bool
add_to_cart_order            int64
reordered                    int64
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_spend              float64
spender_flag                object
customer_frequency         float64
frequency_flag              object
First_name                  object
Last_name                   object
Gender                      object
State                       object
Age                          int64
Date_joined                 object
number_of_dependants         int64
Marital_status              object
Income                       int64
_merge                    category
dtype: object

In [44]:
# The 'order_id' column also has the wrong data type, so let's fix it
custs_ords_prods['order_id'] = custs_ords_prods['order_id'].astype('str')

In [45]:
custs_ords_prods.dtypes

product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
order_id                    object
user_id                     object
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
first_order                   bool
add_to_cart_order            int64
reordered                    int64
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_spend              float64
spender_flag                object
customer_frequency         float64
frequency_flag              object
First_name                  object
Last_name                   object
Gender                      object
State                       object
Age                          int64
Date_joined                 object
number_of_dependants         int64
Marital_status              object
Income                       int64
_merge                    category
dtype: object

In [46]:
#Export this new dataframe
custs_ords_prods.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge_customers.pkl'))

In [47]:
#Export this new dataframe
custs_ords_prods.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge_customers.csv'))